benchmark/fio/results/home_01.txt
======= Output file: /home/llm-jp-admin/io_test/tmp_96.fio =======
======= Sequential write =======
sequential_write: (g=0): rw=write, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=psync, iodepth=1
...
fio-3.37-60-g6eaa64
Starting 16 processes
sequential_write: Laying out IO file (1 file / 1024MiB)

sequential_write: (groupid=0, jobs=16): err= 0: pid=240692: Tue Jul  9 18:48:26 2024
  write: IOPS=114k, BW=3569MiB/s (3742MB/s)(16.0GiB/4591msec); 0 zone resets
    clat (usec): min=9, max=120292, avg=132.89, stdev=1821.76
     lat (usec): min=9, max=120292, avg=133.47, stdev=1824.92
    clat percentiles (usec):
     |  1.00th=[   12],  5.00th=[   13], 10.00th=[   13], 20.00th=[   13],
     | 30.00th=[   13], 40.00th=[   14], 50.00th=[   16], 60.00th=[   17],
     | 70.00th=[   18], 80.00th=[   21], 90.00th=[   25], 95.00th=[   29],
     | 99.00th=[   48], 99.50th=[ 7242], 99.90th=[30278], 99.95th=[38536],
     | 99.99th=[58459]
   bw (  MiB/s): min= 2563, max= 4915, per=100.00%, avg=3717.47, stdev=55.12, samples=136
   iops        : min=82038, max=157292, avg=118957.49, stdev=1763.86, samples=136
  lat (usec)   : 10=0.07%, 20=79.78%, 50=19.18%, 100=0.18%, 250=0.08%
  lat (usec)   : 500=0.02%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.03%, 4=0.06%, 10=0.15%, 20=0.21%, 50=0.20%
  lat (msec)   : 100=0.02%, 250=0.01%
  cpu          : usr=0.59%, sys=12.23%, ctx=12713, majf=0, minf=492
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,524288,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=3569MiB/s (3742MB/s), 3569MiB/s-3569MiB/s (3742MB/s-3742MB/s), io=16.0GiB (17.2GB), run=4591-4591msec
======= Sequential read =======
sequential_read: (g=0): rw=read, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=psync, iodepth=1
...
fio-3.37-60-g6eaa64
Starting 16 processes

sequential_read: (groupid=0, jobs=16): err= 0: pid=240718: Tue Jul  9 18:48:29 2024
  read: IOPS=234k, BW=7308MiB/s (7663MB/s)(16.0GiB/2242msec)
    clat (nsec): min=1944, max=275877k, avg=43031.97, stdev=1248539.61
     lat (nsec): min=1978, max=275877k, avg=43076.40, stdev=1248539.59
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    4], 10.00th=[    4], 20.00th=[    4],
     | 30.00th=[    4], 40.00th=[    4], 50.00th=[    5], 60.00th=[    5],
     | 70.00th=[    5], 80.00th=[    6], 90.00th=[    7], 95.00th=[    7],
     | 99.00th=[   12], 99.50th=[  153], 99.90th=[19006], 99.95th=[29230],
     | 99.99th=[52691]
   bw (  MiB/s): min= 5656, max=11572, per=100.00%, avg=9226.73, stdev=165.89, samples=48
   iops        : min=181018, max=370328, avg=295255.33, stdev=5308.48, samples=48
  lat (usec)   : 2=0.01%, 4=45.56%, 10=52.90%, 20=0.84%, 50=0.07%
  lat (usec)   : 100=0.02%, 250=0.46%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.02%, 50=0.08%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=0.73%, sys=11.83%, ctx=25194, majf=0, minf=653
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=524288,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=7308MiB/s (7663MB/s), 7308MiB/s-7308MiB/s (7663MB/s-7663MB/s), io=16.0GiB (17.2GB), run=2242-2242msec
======= Random write =======
random_write: (g=0): rw=randwrite, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=psync, iodepth=1
...
fio-3.37-60-g6eaa64
Starting 16 processes

random_write: (groupid=0, jobs=16): err= 0: pid=240748: Tue Jul  9 18:48:34 2024
  write: IOPS=86.0k, BW=2689MiB/s (2820MB/s)(13.2GiB/5020msec); 0 zone resets
    clat (usec): min=9, max=67829, avg=159.60, stdev=1889.43
     lat (usec): min=9, max=67829, avg=160.92, stdev=1896.79
    clat percentiles (usec):
     |  1.00th=[   15],  5.00th=[   16], 10.00th=[   17], 20.00th=[   17],
     | 30.00th=[   17], 40.00th=[   18], 50.00th=[   18], 60.00th=[   18],
     | 70.00th=[   19], 80.00th=[   22], 90.00th=[   24], 95.00th=[   27],
     | 99.00th=[   37], 99.50th=[11863], 99.90th=[30802], 99.95th=[35914],
     | 99.99th=[44827]
   bw (  MiB/s): min= 2072, max= 3888, per=100.00%, avg=2996.27, stdev=40.28, samples=141
   iops        : min=66306, max=124440, avg=95880.60, stdev=1288.91, samples=141
  lat (usec)   : 10=0.01%, 20=75.67%, 50=23.54%, 100=0.03%, 250=0.01%
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.03%, 10=0.15%, 20=0.24%, 50=0.31%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.51%, sys=11.46%, ctx=5863, majf=0, minf=489
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,431966,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2689MiB/s (2820MB/s), 2689MiB/s-2689MiB/s (2820MB/s-2820MB/s), io=13.2GiB (14.2GB), run=5020-5020msec
======= Random read =======
random_read: (g=0): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=psync, iodepth=1
...
fio-3.37-60-g6eaa64
Starting 16 processes

random_read: (groupid=0, jobs=16): err= 0: pid=240775: Tue Jul  9 18:48:38 2024
  read: IOPS=169k, BW=5268MiB/s (5524MB/s)(16.0GiB/3110msec)
    clat (usec): min=2, max=60015, avg=52.26, stdev=1215.06
     lat (usec): min=2, max=60015, avg=52.90, stdev=1222.58
    clat percentiles (usec):
     |  1.00th=[    6],  5.00th=[    6], 10.00th=[    7], 20.00th=[    7],
     | 30.00th=[    7], 40.00th=[    7], 50.00th=[    7], 60.00th=[    7],
     | 70.00th=[    7], 80.00th=[    7], 90.00th=[    8], 95.00th=[    8],
     | 99.00th=[    9], 99.50th=[   12], 99.90th=[27919], 99.95th=[30016],
     | 99.99th=[41157]
   bw (  MiB/s): min= 4808, max= 9125, per=100.00%, avg=7789.79, stdev=113.16, samples=63
   iops        : min=153876, max=292016, avg=249273.17, stdev=3621.13, samples=63
  lat (usec)   : 4=0.05%, 10=99.18%, 20=0.58%, 50=0.05%, 100=0.01%
  lat (usec)   : 250=0.01%
  lat (msec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.14%, 100=0.01%
  cpu          : usr=0.61%, sys=11.93%, ctx=1918, majf=0, minf=652
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=524288,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=5268MiB/s (5524MB/s), 5268MiB/s-5268MiB/s (5524MB/s-5524MB/s), io=16.0GiB (17.2GB), run=3110-3110msec